app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "207281424"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 03 Jul 2013 01:25:38 UTC +00:00], ["updated_at", Wed, 03 Jul 2013 01:25:38 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Thu, 11 Jul 2013 06:40:22 UTC +00:00], ["order_id", nil], ["product_id", 207281424], ["quantity", 1], ["updated_at", Thu, 11 Jul 2013 06:40:22 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2013-07-08 08:14:09.060635' WHERE "line_items"."id" = 7
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save