app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index
    @orders = Order.paginate page: params[:page], order: 'created_at desc',
      per_page: 10